cases/MySim/sim/0.orig/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;    location "0.orig";
    object p;
}

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 101325.0;

boundaryField
{
    wall_0F_7
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    wall_0F_10
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    wall_0F_13
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    window_0F_1
    {
    
        type calculated;
    
        value $internalField;
    }
    wall_0F_14
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    wall_0F_15
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    door_0F_1
    {
    
        type calculated;
    
        value $internalField;
    }
    wall_0F_16
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    floor_0F
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
    ceil_0F
    {
    
        type calculated;
    
        value uniform 101325.0;
    }
}
